#ifndef __LCD1602_H__
#define __LCD1602_H__
#include <reg51.h>
typedef unsigned char uchar;
typedef unsigned int  uint;
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<LCD设置函数>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
#define vdInitialize()	vWriteCMD(0x01);vWriteCMD(0x38);vWriteCMD(0x0C);		//初始化
sbit LCDRS=P3^5;								   //寄存器选择信号：
												   //		0--数据寄存器；
												   //		1--指令寄存器。
sbit LCDRW=P3^6;								   //读写信号：
												   //		1--读LCD；
												   //		0--写LCD。
sbit LCDE=P3^7;								   //片选信号，当输入下降沿信号时，
												   //执行指令或传送数据。
#define LCDPORT P0								   //LCD数据接口。
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<写数据命令函数>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
void vDelay();									   //延时函数。
void vWriteCMD(unsigned char ucCommand);		   //把1个命令写入LCD。
void vWriteData(unsigned char ucData);			   //把1个数据写入LCD。
void vShowOneChar(unsigned char ucChar);
void vShowChar(unsigned char ucaChar[]);

#endif